# Importing Libraries

In [1]:
import pandas as pd
import numpy as np

# Task 1

## 1.0 Loading the data

In [2]:
data1 = pd.read_excel("Records Matching Task.xlsx",'data1')
data2 = pd.read_excel("Records Matching Task.xlsx",'data2')

In [3]:
data1.head()

         Order ID       Product ID  Qty
0  CA-2014-100006  TEC-PH-10002075  3.0
1  CA-2014-100090  FUR-TA-10003715  3.0
2  CA-2014-100090  OFF-BI-10001597  6.0
3  CA-2014-100293  OFF-PA-10000176  6.0
4  CA-2014-100328  OFF-BI-10000343  1.0

In [4]:
data2.head()

         Order ID       Product ID  Qty
0  CA-2014-100090  FUR-TA-10003715  3.0
1  CA-2014-100090  OFF-BI-10001597  6.0
2  CA-2014-100293  OFF-PA-10000176  6.0
3  CA-2014-100328  OFF-BI-10000343  1.0
4  CA-2014-100363  OFF-FA-10000611  2.0

## 1.1 Answer No. 1(LEFT JOIN)

**To identify the Records (Order ID + Product ID combination) present in data1 but missing in data2**   
To solve the above question we need to do left join    
507 number of rows are present in data1 but not in data2.The resulting dataframe obtained is stored in data_left

In [5]:
data_left = data1.merge(data2, on=['Order ID','Product ID'],how='left', indicator=True)
data_left = data_left[data_left['_merge'] == 'left_only']

data_left = data_left.drop(columns=['Qty_y','_merge'])
data_left.to_excel("ans1.xlsx",index=False)
data_left = pd.read_excel("ans1.xlsx")
data_left.head()

         Order ID       Product ID  Qty_x
0  CA-2014-100006  TEC-PH-10002075      3
1  CA-2014-100678  OFF-EN-10000056      3
2  CA-2014-100895  OFF-AR-10004511      2
3  CA-2014-101560  OFF-BI-10000309      3
4  CA-2014-102673  OFF-LA-10001771     12

In [6]:
data_left.shape

(507, 3)

## 1.2 Answer No. 2(Right Join)

**To identify the Records (Order ID + Product ID combination) missing in data1 but present in data2**  

To solve the above question we need to do right join    
508 number of rows are present in data2 but not in data1.The resulting dataframe obtained is stored in data_right

In [7]:
data_right = data1.merge(data2, on=['Order ID','Product ID'],how='right', indicator=True)
data_right = data_right[data_right['_merge'] == 'right_only']

data_right = data_right.drop(columns=['Qty_x','_merge'])

data_right.to_excel("ans2.xlsx",index=False)
data_right = pd.read_excel("ans2.xlsx")
data_right.head()

         Order ID       Product ID  Qty_y
0  CA-2014-100706  TEC-AC-10001314      2
1  CA-2014-100762  OFF-PA-10001815      3
2  CA-2014-101427  OFF-AR-10002257      3
3  CA-2014-102652  FUR-FU-10001918      7
4  CA-2014-102869  OFF-PA-10000788      3

In [8]:
data_right.shape

(508, 3)

## 1.3 Answer No.3 

**Sum of the total Qty of Records missing in data1 but present in data2**


Total quantity of records missing in data1 but present in data2 is 1874

In [9]:
data_left.head()

         Order ID       Product ID  Qty_x
0  CA-2014-100006  TEC-PH-10002075      3
1  CA-2014-100678  OFF-EN-10000056      3
2  CA-2014-100895  OFF-AR-10004511      2
3  CA-2014-101560  OFF-BI-10000309      3
4  CA-2014-102673  OFF-LA-10001771     12

In [10]:
np.sum(data_left['Qty_x'].tolist())

1874

# 1.4 Answer No. 4 (Inner Join)

**Total number of unique records (Order ID + Product ID combination) present in the combined dataset of data1 and data2**   
We need to do inner join for this and data obtained is stored in data_intersection 
Total number of unique records = number of rows in data_intersection is 8971

In [11]:
data_intersection = data1.merge(data2, on=['Order ID','Product ID'],how='inner', indicator=True)
data_intersection = data_intersection[data_intersection['_merge'] == 'both']

data_intersection = data_intersection.drop(columns=['_merge'])
data_intersection.to_excel("ans2.xlsx",index=False)
data_intersection = pd.read_excel("ans2.xlsx")
data_intersection.head()

         Order ID       Product ID  Qty_x  Qty_y
0  CA-2014-100090  FUR-TA-10003715      3      3
1  CA-2014-100090  OFF-BI-10001597      6      6
2  CA-2014-100293  OFF-PA-10000176      6      6
3  CA-2014-100328  OFF-BI-10000343      1      1
4  CA-2014-100363  OFF-FA-10000611      2      2

In [12]:
data_intersection.shape

(8971, 4)

# Task 2

## 2.0 Loading the data

In [13]:
data = pd.read_csv("used_bikes.csv")

In [14]:
data.head()

,bike_name,price,city,kms_driven,owner,age,power,brand
0,TVS Star City Plus Dual Tone 110cc,35000.0,Ahmedabad,17654.0,First Owner,3.0,110.0,TVS
1,Royal Enfield Classic 350cc,119900.0,Delhi,11000.0,First Owner,4.0,350.0,Royal Enfield
2,Triumph Daytona 675R,600000.0,Delhi,110.0,First Owner,8.0,675.0,Triumph
3,TVS Apache RTR 180cc,65000.0,Bangalore,16329.0,First Owner,4.0,180.0,TVS
4,Yamaha FZ S V 2.0 150cc-Ltd. Edition,80000.0,Bangalore,10000.0,First Owner,3.0,150.0,Yamaha

In [15]:
data.shape

(149, 8)